Revit 2026 API

# UIControlledApplicationGetRibbonPanels(Tab) Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual List<RibbonPanel> GetRibbonPanels(
	Tab tab
)
```
```vb
Public Overridable Function GetRibbonPanels (
	tab As Tab
) As List(Of RibbonPanel)
```
```cpp
public:
virtual List<RibbonPanel^>^ GetRibbonPanels(
	Tab tab
)
```
```fsharp
abstract GetRibbonPanels :
        tab : Tab -> List<RibbonPanel>
override GetRibbonPanels :
        tab : Tab -> List<RibbonPanel>
```

#### Parameters

tab Tab

#### Return Value

ListRibbonPanel

#### Reference

UIControlledApplication Class

GetRibbonPanels Overload

Autodesk.Revit.UI Namespace